package com.epam.ryndych;

import org.apache.log4j.Logger;


public class Main {

	// Спробую трішки поянити щоб легше сприймалось:)
	// Значить основну роль в мене виконують класи Task, Text, Sentence.
	// У класі Task відбувається читання з файла, створення екземпляра класаText
	// та ліста екземплярів класа Sentence.
	//
	// Клас Text приймає в конструктор значення зчитаного з файла тексту ,
	// ділить його на речення за допомогою регулярних виразів, та обраховує
	// кількість рядків з однаковими словами.
	// (для кожного речення отримується аррейліст лексем. Після чого в циклі
	// здійснюється запис Слів та номер речення їх останнього знаходження у
	// хешмапу. Якщо слово уже є в хешмапі і поточне речення не відповідає
	// значенню в хешмапі тоді число повторень слова в різних рядках
	// збільшується на одиницю(всі числа повторень та слова які повторюються
	// містяться в іншіій хеш мапі) )
	//
	// Клас Sentence отримує в конструкторі речення і ділить його на лексеми (
	// ділить речення на лексеми за допомогою регулярного виразу, а потім
	// підбираючи інші регулярні вирази створюються екземпляри класів
	// Word,Number,Punctuation,UnknownSymbol)
	//
	// В DisplayingOfDirectories реалізовано можливість рухатись по поточних
	// каталогах і вибрати файл для якого буде виконуватись завдання.

	public static final Logger LOG = Logger.getLogger(Main.class);

	public static void main(String[] args) {
		LOG.info("Start program");
		
		new DisplayingOfDirectories().execute();
	}
}
